[{"name":"Abstract","type":"KW_TYPE_BOOLEAN","description":"Specifies that this is an abstract method. An abstract method has no implementation and has no executable code generated for it. Abstract methods exist solely for the purpose of defining a method signature or interface that can be overridden and implemented within one or more subclasses. "},{"name":"CodeMode","constraint":["call","code","expression","generator","objectgenerator"],"description":"Specifies how a given method is implemented: as a routine call, lines of code to be compiled, an expression, or a method that will generate the resulting method or object."},{"name":"Deprecated","type":"KW_TYPE_BOOLEAN","description":"True if this method is deprecated."},{"name":"ExternalProcName","description":"Specifies the SQL procedure name in the foreign database."},{"name":"Final","type":"KW_TYPE_BOOLEAN","description":"Specifies that subclasses cannot override the implementation of the method."},{"name":"ForceGenerate","type":"KW_TYPE_BOOLEAN","description":"When true we always regenerate this method into each subclass even if normal rules would allow us to call the superclass implementation."},{"name":"GenerateAfter","type":"KW_TYPE_COSIDENTIFIER","constraint":"KW_SYSENUM_METHOD_LIST","description":"In the case of a method generator method, specifies that the generator should be invoked after the listed methods are generated."},{"name":"Internal","type":"KW_TYPE_BOOLEAN","description":"If true, then do not display this item in automatic documentation."},{"name":"Language","constraint":["basic","objectscript","java","javascript","mvbasic","tsql","ispl"],"description":"The language used to implement this method."},{"name":"NoContext","type":"KW_TYPE_BOOLEAN","description":"If true and in a datatype method, this prevents the * Set %val=..prop Set $this=\"\" * that is added to the property method so you can override things like the Get/Set methods."},{"name":"NotInheritable","type":"KW_TYPE_BOOLEAN","description":"Specifies that this method is not inherited in subclasses."},{"name":"PlaceAfter","type":"KW_TYPE_COSIDENTIFIER","constraint":"KW_SYSENUM_METHOD_LIST","description":"Specifies that the class compiler should place this method after the listed methods in the routine it creates for the class."},{"name":"Private","type":"KW_TYPE_BOOLEAN","description":"Specifies that the method is private. Private methods can only be invoked by instance methods of this class or its subclasses."},{"name":"ProcedureBlock","constraint":["0","1"],"description":"Specifies that this method uses procedure block for method code."},{"name":"PublicList","type":"KW_TYPE_COSIDENTIFIER","description":"Specifies the public list.  This keyword is used only if the ProcedureBlock keyword is set to true."},{"name":"Requires","description":"Comma separated string of resource constraints to run this method"},{"name":"ReturnResultsets","type":"KW_TYPE_BOOLEAN","description":"If true this method may return zero, one, or more Resultsets in the %sqlcontext."},{"name":"RuntimeCodeMode","description":"CodeMode to use for generated methods"},{"name":"ServerOnly","constraint":["0","1"],"description":"Specifies that a method will not be projected to a Java or C++ client."},{"name":"SoapAction","description":"Lets you specify the HTTP SOAP action that must be used when invoking this web service method as a web method. For SOAP 1.1, the SOAP action is obtained from the SOAPAction HTTP header. For SOAP 1.2, it is obtained from the Content-Type HTTP header."},{"name":"SoapBindingStyle","constraint":["document","rpc"],"description":"Specifies what type of SOAP invocation is used for a web method. This keyword is ignored for non-web methods."},{"name":"SoapBodyUse","constraint":["literal","encoded"],"description":"Specifies what kind of SOAP encoding is used for the inputs and outputs of a web method. This keyword is ignored for non-web methods."},{"name":"SoapMessageName","description":"Specifies the name of the child element of the body of the response message for a web service method."},{"name":"SoapNameSpace","description":"Overrides the SOAPNAMESPACE class parameter for this web service or web service client."},{"name":"SoapRequestMessage","description":" This keyword will reflects the expected element name for top element of the SOAP body in the SOAP request.  This element is needed to distinguish between multiple requests which have the same SoapAction but different top level body elements."},{"name":"SoapTypeNameSpace","description":"Overrides the SOAPTYPENAMESPACE class parameter for this web service or web service client."},{"name":"SqlName","type":"KW_TYPE_SQLIDENTIFIER","description":"If this method is projected as an SQL stored procedure, then this name is used as the name of the stored procedure."},{"name":"SqlProc","type":"KW_TYPE_BOOLEAN","description":"Specifies that the method can be invoked as an SQL stored procedure. Only class methods can be called as SQL stored procedures."},{"name":"SqlRoutine","constraint":["procedure","function"],"description":"If 'procedure' then this is equivalent to SqlProc keyword and means class method can be called as an SQL procedure. If 'function' then this class method can be called as an SQL function."},{"name":"WebMethod","type":"KW_TYPE_BOOLEAN","description":"Specifies that a method can be invoked as a web method using the SOAP protocol."},{"name":"ZenMethod","type":"KW_TYPE_BOOLEAN","description":"Specifies that the method should be projected to the web client for use in the Zen framework."}]