[{"name":"Aliases","type":"KW_TYPE_TEXT","description":"List of aliases for this property."},{"name":"Calculated","type":"KW_TYPE_BOOLEAN","description":"Specifies that the property has no in-memory storage allocated for it when the object containing it is instantiated."},{"name":"Cardinality","constraint":["one","many","parent","children"],"description":"Specifies the cardinality of a relationship property. The Cardinality keyword is required for relationship properties. It is ignored by non-relationship properties. "},{"name":"ComputeDependency","description":"List of properties referenced by the SQLCOMPUTECODE."},{"name":"ComputeTriggers","description":"List of properties to be computed when this property changes."},{"name":"Deprecated","type":"KW_TYPE_BOOLEAN","description":"True if this property is deprecated."},{"name":"DirectRefOnGet","type":"KW_TYPE_BOOLEAN","description":"Deprecated"},{"name":"DirectRefOnSet","type":"KW_TYPE_BOOLEAN","description":"Deprecated"},{"name":"Final","type":"KW_TYPE_BOOLEAN","description":"Specifies that subclasses cannot override the definition of this property."},{"name":"Identity","type":"KW_TYPE_BOOLEAN","description":"Specifies that this property is the identity for this class. Identity properties can be set in new objects only and the default is set by incrementing a counter."},{"name":"InitialExpression","type":"KW_TYPE_EXPRESSION","description":"Specifies an initial value for the property."},{"name":"Internal","type":"KW_TYPE_BOOLEAN","description":"If true, then do not display this item in automatic documentation."},{"name":"Inverse","description":"Specifies the name of the inverse side of a relationship. That is, the name of the corresponding relationship property in the related class. The inverse property must exist in the related class and have the correct Cardinality value. The Inverse keyword is required for relationship properties. It is ignored by non-relationship properties."},{"name":"MultiDimensional","type":"KW_TYPE_BOOLEAN","description":"Specifies that an attribute has the characteristics of a multidimensional array."},{"name":"OnDelete","constraint":["cascade","noaction","setdefault","setnull"],"description":"Specifies what referential action to take when the key value is deleted from the foreign table."},{"name":"Private","type":"KW_TYPE_BOOLEAN","description":"Specifies that the property is private. Private properties can only be used by instance methods of this class or its subclasses."},{"name":"ReadOnly","type":"KW_TYPE_BOOLEAN","description":"Specifies that the property is readonly."},{"name":"Required","type":"KW_TYPE_BOOLEAN","description":"In the case of a persistent class, specifies that the value of the property must be given a value before it can be stored to disk."},{"name":"ServerOnly","constraint":["0","1"],"description":"Specifies that a property will not be projected to a Java or C++ client."},{"name":"SqlCollation","constraint":["ALPHAUP","PLUS","MINUS","SPACE","EXACT","UPPER"],"description":"Deprecated."},{"name":"SqlColumnNumber","description":"Explicitly sets the SQL Column number for this property. This is provided for legacy application support."},{"name":"SqlComputeCode","type":"KW_TYPE_CODE","description":"Specifies ObjectScript code that evaluates to a computed field value. "},{"name":"SqlComputed","type":"KW_TYPE_BOOLEAN","description":"Specifies that this property is an SQL computed field."},{"name":"SqlComputeOnChange","type":"KW_TYPE_PROPERTYSQLCOMPUTEONCHANGE","constraint":"KW_SYSENUM_PROPERTYSQLCOMPUTEONCHANGE_LIST","description":"Specifies one or more properties whose modification triggers the recalculation of this computed field within SQL."},{"name":"SqlFieldName","type":"KW_TYPE_SQLIDENTIFIER","description":"In the case of a persistent class, specifies the column name used to identify the property in its SQL projection. By default, the SQL column name is the same as the property name."},{"name":"SqlListDelimiter","description":"Specifies the delimiter character used within SQL for lists. This is provided for legacy application support."},{"name":"SqlListType","constraint":["DELIMITED","LIST","SUBNODE"],"description":"specifies the representation to be used for a list."},{"name":"Transient","type":"KW_TYPE_BOOLEAN","description":"In the case of a persistent class, specifies that the property is not stored in the database."}]